# Building mySQL Data-base

In [3]:
import pandas as pd
pd.set_option('display.max_columns', None)

import numpy as np

import warnings
warnings.filterwarnings('ignore')


import pylab as plt  # import matplotlib.pyplot as plt
import seaborn as sns

# Exploración y limpieza de los datos.

# 1. DataFrame Actor.

In [4]:
df_original_actor = pd.read_csv('data/actor.csv', encoding='latin1')
df_actor = df_original_actor.copy()

In [5]:
dim_original_actor = df_actor.shape # De esta forma guardo las dimensiones del data frame original.
df_actor.shape

(200, 4)

In [6]:
df_actor.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [7]:
df_actor.info() # De este modo conzco el tipo de dato y los valores nulos que tiene cada una de las columnas.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     200 non-null    int64
 1   first_name   200 non-null    object
 2   last_name    200 non-null    object
 3   last_update  200 non-null    object
dtypes: int64(1), object(3)
memory usage: 6.4+ KB

In [8]:
df_actor.actor_id.unique() # Este procedimiento me ayuda a encontrar cada uno de los valores de la columna especificada.

array([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
        14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,
        27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,  39,
        40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,  52,
        53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,  65,
        66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,  78,
        79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,  91,
        92,  93,  94,  95,  96,  97,  98,  99, 100, 101, 102, 103, 104,
       105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117,
       118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130,
       131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143,
       144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156,
       157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169,
       170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182,
       183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195,
       196, 197, 198, 199, 200])

In [9]:
df_actor.first_name.unique()

array(['PENELOPE', 'NICK', 'ED', 'JENNIFER', 'JOHNNY', 'BETTE', 'GRACE',
       'MATTHEW', 'JOE', 'CHRISTIAN', 'ZERO', 'KARL', 'UMA', 'VIVIEN',
       'CUBA', 'FRED', 'HELEN', 'DAN', 'BOB', 'LUCILLE', 'KIRSTEN',
       'ELVIS', 'SANDRA', 'CAMERON', 'KEVIN', 'RIP', 'JULIA', 'WOODY',
       'ALEC', 'SISSY', 'TIM', 'MILLA', 'AUDREY', 'JUDY', 'BURT', 'VAL',
       'TOM', 'GOLDIE', 'JODIE', 'KIRK', 'REESE', 'PARKER', 'FRANCES',
       'ANNE', 'NATALIE', 'GARY', 'CARMEN', 'MENA', 'FAY', 'JUDE',
       'DUSTIN', 'HENRY', 'JAYNE', 'RAY', 'ANGELA', 'MARY', 'JESSICA',
       'KENNETH', 'MICHELLE', 'ADAM', 'SEAN', 'ANGELINA', 'CARY',
       'GROUCHO', 'MAE', 'RALPH', 'SCARLETT', 'BEN', 'JAMES', 'MINNIE',
       'GREG', 'SPENCER', 'CHARLIZE', 'CHRISTOPHER', 'ELLEN', 'DARYL',
       'GENE', 'MEG', 'CHRIS', 'JIM', 'SUSAN', 'WALTER', 'SIDNEY', 'GINA',
       'WARREN', 'SYLVESTER', 'RUSSELL', 'MORGAN', 'HARRISON', 'RENEE',
       'LIZA', 'SALMA', 'JULIANNE', 'ALBERT', 'CATE', 'GRETA', 'JANE',
       'RICHARD', 'RITA', 'EWAN', 'WHOOPI', 'JADA', 'RIVER', 'KIM',
       'EMILY', 'GEOFFREY', 'MERYL', 'IAN', 'LAURA', 'HARVEY', 'OPRAH',
       'HUMPHREY', 'AL', 'LAURENCE', 'WILL', 'OLYMPIA', 'ALAN', 'MICHAEL',
       'WILLIAM', 'JON', 'LISA', 'JEFF', 'DEBBIE', 'ROCK', 'GREGORY',
       'JOHN', 'BELA', 'THORA'], dtype=object)

In [10]:
df_actor.last_name.unique()

array(['GUINESS', 'WAHLBERG', 'CHASE', 'DAVIS', 'LOLLOBRIGIDA',
       'NICHOLSON', 'MOSTEL', 'JOHANSSON', 'SWANK', 'GABLE', 'CAGE',
       'BERRY', 'WOOD', 'BERGEN', 'OLIVIER', 'COSTNER', 'VOIGHT', 'TORN',
       'FAWCETT', 'TRACY', 'PALTROW', 'MARX', 'KILMER', 'STREEP', 'BLOOM',
       'CRAWFORD', 'MCQUEEN', 'HOFFMAN', 'WAYNE', 'PECK', 'SOBIESKI',
       'HACKMAN', 'DEAN', 'DUKAKIS', 'BOLGER', 'MCKELLEN', 'BRODY',
       'DEGENERES', 'MIRANDA', 'JOVOVICH', 'STALLONE', 'GOLDBERG',
       'BARRYMORE', 'DAY-LEWIS', 'CRONYN', 'HOPKINS', 'PHOENIX', 'HUNT',
       'TEMPLE', 'PINKETT', 'HARRIS', 'CRUISE', 'AKROYD', 'TAUTOU',
       'NEESON', 'WRAY', 'HUDSON', 'TANDY', 'BAILEY', 'WINSLET',
       'MCCONAUGHEY', 'GRANT', 'WILLIAMS', 'PENN', 'KEITEL', 'POSEY',
       'ASTAIRE', 'SINATRA', 'CRUZ', 'DAMON', 'JOLIE', 'WILLIS', 'PITT',
       'ZELLWEGER', 'CHAPLIN', 'PESCI', 'DENCH', 'PRESLEY', 'HAWKE',
       'BRIDGES', 'DEPP', 'LEIGH', 'CROWE', 'DUNST', 'NOLTE', 'DERN',
       'BACALL', 'MCDORMAND', 'BALE', 'ALLEN', 'JACKMAN', 'MONROE',
       'BERGMAN', 'BENING', 'TOMEI', 'GARLAND', 'HOPPER', 'REYNOLDS',
       'MANSFIELD', 'DEE', 'GOODING', 'HURT', 'RYDER', 'WITHERSPOON',
       'HESTON', 'GIBSON', 'MALDEN', 'BASINGER', 'HOPE', 'WEST',
       'BULLOCK', 'WILSON', 'PFEIFFER', 'DREYFUSS', 'SILVERSTONE',
       'CARREY', 'CLOSE', 'BALL', 'BIRCH', 'SUVARI', 'WALKEN'],
      dtype=object)

In [11]:
df_actor.last_update.unique()

array(['2006-02-15 04:34:33'], dtype=object)

Como se puede observar en la columna recién mencionada ("last_update"), todos sus valores son idénticos y se repiten de manera constante a lo largo de toda la columna. Por este motivo, al no aportar ninguna información relevante, se procede a su eliminación.

In [12]:
df_actor.drop(columns=["last_update"], inplace=True)

In [13]:
df_actor.head()

   actor_id first_name     last_name
0         1   PENELOPE       GUINESS
1         2       NICK      WAHLBERG
2         3         ED         CHASE
3         4   JENNIFER         DAVIS
4         5     JOHNNY  LOLLOBRIGIDA

Considero que la combinación de las columnas "first_name" y  "last_name" en una sola columna llamada "actor_name," que contendría el nombre completo de la persona, simplicaría el posterior trabajo y manejo de la tabla.

In [14]:
df_actor["actor_name"] = df_actor["first_name"] + ' ' + df_actor["last_name"]

In [15]:
df_actor.drop(columns=["first_name"], inplace=True) #Borro aquí las columnas que me ha proporcionado la información para la creación de la nueva columna.
df_actor.drop(columns=["last_name"], inplace=True)

In [16]:
df_actor.head()

   actor_id           actor_name
0         1     PENELOPE GUINESS
1         2        NICK WAHLBERG
2         3             ED CHASE
3         4       JENNIFER DAVIS
4         5  JOHNNY LOLLOBRIGIDA

In [17]:
df_actor["actor_name"].value_counts()

SUSAN DAVIS             2
EWAN GOODING            1
DARYL CRAWFORD          1
GRETA KEITEL            1
JANE JACKMAN            1
                       ..
MICHELLE MCCONAUGHEY    1
ADAM GRANT              1
SEAN WILLIAMS           1
GARY PENN               1
THORA TEMPLE            1
Name: actor_name, Length: 199, dtype: int64

Al examinar los valores únicos en la columna "actor_name," notamos la presencia de un valor repetido. Ante esta situación, cabrían dos opciones: mantenerlo tal como está, ya que los identificadores (ID) son diferentes, o eliminarlo. 

En este caso, vamos a ponernos en la situación y considerar que se trata de dos personas distintas y, por lo tanto, procedemos a eliminar una de las filas en las que se encuentra dicho valor.

In [18]:
fila_susan = df_actor[df_actor["actor_name"] == "SUSAN DAVIS"]
fila_susan

     actor_id   actor_name
100       101  SUSAN DAVIS
109       110  SUSAN DAVIS

In [19]:
df_actor = df_actor.drop(109)

In [20]:
df_actor = df_actor.reset_index(drop=True)

In [21]:
df_actor.shape

(199, 2)

In [22]:
# Columnas que contienen valores nulos y la cantidad de estos en cada una de ellas:

nan_cols_actor = df_actor.isna().sum() #En este caso vemos que ninguna.
nan_cols_actor[nan_cols_actor>0]

Series([], dtype: int64)

In [23]:
df_actor.duplicated().any() #Compruebo duplicados.

False

In [24]:
df_actor.head()

   actor_id           actor_name
0         1     PENELOPE GUINESS
1         2        NICK WAHLBERG
2         3             ED CHASE
3         4       JENNIFER DAVIS
4         5  JOHNNY LOLLOBRIGIDA

# 2. DataFrame Category.

In [32]:
df_original_category = pd.read_csv('data/category.csv', encoding='latin1')
df_category = df_original_category.copy()

In [33]:
dim_original_category = df_category.shape # Del mismo modo que antes, guardo las dimensiones del data frame original.
df_category.shape

(16, 3)

In [34]:
df_category.head()

   category_id       name          last_update
0            1     Action  2006-02-15 04:46:27
1            2  Animation  2006-02-15 04:46:27
2            3   Children  2006-02-15 04:46:27
3            4   Classics  2006-02-15 04:46:27
4            5     Comedy  2006-02-15 04:46:27

In [35]:
df_category.info() # Observamos el tipo de dato y los posibles valores nulos que tiene cada una de las columnas.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   category_id  16 non-null     int64
 1   name         16 non-null     object
 2   last_update  16 non-null     object
dtypes: int64(1), object(2)
memory usage: 516.0+ bytes

In [36]:
df_category.category_id.unique() # Ahora, los valores únicos de las diferentes columnas que componen el DataFrame.

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16])

In [37]:
df_category.name.unique()

array(['Action', 'Animation', 'Children', 'Classics', 'Comedy',
       'Documentary', 'Drama', 'Family', 'Foreign', 'Games', 'Horror',
       'Music', 'New', 'Sci-Fi', 'Sports', 'Travel'], dtype=object)

No se aprecia nada raro hasta que nos encontramos, al igual que en el caso anterior, con la columna "last_update", compuesta por un único valor que no nos aporta ninguna información destacable. Se procede a su eliminación:

In [38]:
df_category.last_update.unique()

array(['2006-02-15 04:46:27'], dtype=object)

In [39]:
df_category.drop(columns=["last_update"], inplace=True)

In [40]:
df_category["name"].value_counts().head() # Revisamos en este caso si también hay algún valor repetido a lo largo de la columna.

Action       1
Animation    1
Children     1
Classics     1
Comedy       1
Name: name, dtype: int64

Considero que sería una buena práctica cambiar el nombre de la columna "name" por motivo de que este nombre de columna se repite en varias tablas con las que debemos trabajar. Esto podría causar confusión cuando manejemos todas las tablas en conjunto.

In [41]:
df_category.rename(columns={"name": "category_name"}, inplace=True)

In [42]:
# Columnas que contienen valores nulos y la cantidad de estos en cada una de ellas:

nan_cols_category = df_category.isna().sum() #De nuevo, ninguna.
nan_cols_category[nan_cols_category>0]

Series([], dtype: int64)

In [43]:
df_category.duplicated().any() #Compruebo duplicados.

False

In [44]:
df_category.head()

   category_id category_name
0            1        Action
1            2     Animation
2            3      Children
3            4      Classics
4            5        Comedy

# 3. DataFrame Film.

In [45]:
df_original_film = pd.read_csv('data/film.csv', encoding='latin1')
df_film = df_original_film.copy()

In [46]:
dim_original_film = df_film.shape # Guardo aquí también las dimensiones del data frame original.
df_film.shape

(1000, 13)

In [47]:
df_film.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [48]:
df_film.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   film_id               1000 non-null   int64
 1   title                 1000 non-null   object
 2   description           1000 non-null   object
 3   release_year          1000 non-null   int64
 4   language_id           1000 non-null   int64
 5   original_language_id  0 non-null      float64
 6   rental_duration       1000 non-null   int64
 7   rental_rate           1000 non-null   float64
 8   length                1000 non-null   int64
 9   replacement_cost      1000 non-null   float64
 10  rating                1000 non-null   object
 11  special_features      1000 non-null   object
 12  last_update           1000 non-null   object
dtypes: float64(3), int64(5), object(5)
memory usage: 101.7+ KB

Primeramente, según la información proporcionada anteriormente, se aprecia que existe una columna en la que todos sus valores son nulos. Por lo tanto, el primer paso será eliminar dicha columna.

In [49]:
df_film.drop(columns=["original_language_id"], inplace=True)

Seguidamente, resulta de interés determinar si alguna de las columnas contiene valores constantes, ya que estos no aportan información adicional o especialmnete relevante. En caso de hallar dichas columnas, se considerará su eliminación.

In [50]:
cte_cols_film = []
for c in df_film.select_dtypes(include=np.number):   # para cada columna numerica.....
    if len(df_film[c].unique()) == 1:
        cte_cols_film.append(c)
cte_cols_film

['release_year', 'language_id']

De hecho, se han identificado dos columnas que cumplen con esta condición (estas deberán eliminarse). 

Sin embargo, es relevante destacar que esta revisión se ha realizado únicamente en las columnas numéricas. No obstante, es necesario considerar que otras columnas podrían presentar la misma situación. Comprobémoslo:

In [51]:
df_film.drop(columns=["release_year"], inplace=True) #primero eliminamos las dos columnas numéricas con valor constante.
df_film.drop(columns=["language_id"], inplace=True)

In [52]:
df_film.last_update.unique()

array(['2006-02-15 05:03:42'], dtype=object)

Al parecer, esta también lo es, por lo que también debe eliminarse.

In [53]:
df_film.drop(columns=["last_update"], inplace=True)

Realizamos la prueba con el resto de ellas, como se puede apreciar a continuación, por el momento, no se reconoce nada sospechoso en las mismas.

In [54]:
#df_film.film_id.unique()

In [55]:
#df_film.title.unique()

In [56]:
#df_film.description.unique()

In [57]:
df_film.rental_duration.unique()

array([6, 3, 7, 5, 4])

In [58]:
#df_film.rental_rate.unique()

In [59]:
#df_film.length.unique()

In [60]:
#df_film.special_features.unique()

In [61]:
#df_film.length.unique()

Ahora, procederé a buscar posibles valores repetidos en alguna de las columnas en las que esto resulte raro, es decir, las no numéricas, en las cuales no hay problema alguno en que el valor se repita:

In [62]:
df_film["film_id"].value_counts()

1       1
672     1
659     1
660     1
661     1
       ..
339     1
340     1
341     1
342     1
1000    1
Name: film_id, Length: 1000, dtype: int64

In [63]:
df_film["title"].value_counts()

ACADEMY DINOSAUR    1
PERFECT GROOVE      1
PARK CITIZEN        1
PARTY KNOCK         1
PAST SUICIDES       1
                   ..
FROGMEN BREAKING    1
FRONTIER CABIN      1
FROST HEAD          1
FUGITIVE MAGUIRE    1
ZORRO ARK           1
Name: title, Length: 1000, dtype: int64

In [64]:
df_film["description"].value_counts()

A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies                   1
A Thrilling Yarn of a Dog And a Dog who must Build a Husband in A Baloon                                           1
A Taut Epistle of a Sumo Wrestler And a Girl who must Face a Husband in Ancient Japan                              1
A Fateful Display of a Technical Writer And a Butler who must Battle a Sumo Wrestler in An Abandoned Mine Shaft    1
A Intrepid Tale of a Madman And a Astronaut who must Challenge a Hunter in A Monastery                             1
                                                                                                                  ..
A Unbelieveable Yarn of a Mad Scientist And a Cat who must Chase a Lumberjack in Australia                         1
A Emotional Story of a Madman And a Waitress who must Battle a Teacher in An Abandoned Fun House                   1
A Amazing Reflection of a Lumberjack And a Cat who must Discover a Husband in A MySQL Convention                   1
A Taut Epistle of a Feminist And a Sumo Wrestler who must Battle a Crocodile in Australia                          1
A Intrepid Panorama of a Mad Scientist And a Boy who must Redeem a Boy in A Monastery                              1
Name: description, Length: 1000, dtype: int64

Revisamos que no haya ningún valor especialemnte atípico para cada una de las columnas númericas de la tabla.

In [65]:
df_film.describe().T

,count,mean,std,min,25%,50%,75%,max
film_id,1000.0,500.500,288.819436,1.00,250.75,500.50,750.25,1000.00
rental_duration,1000.0,4.985,1.411654,3.00,4.00,5.00,6.00,7.00
rental_rate,1000.0,2.980,1.646393,0.99,0.99,2.99,4.99,4.99
length,1000.0,115.272,40.426332,46.00,80.00,114.00,149.25,185.00
replacement_cost,1000.0,19.984,6.050833,9.99,14.99,19.99,24.99,29.99

Tanto la duración del alquiler, el coste de este, la duración o los costes de reposición no presentan nada que sea digno de anotar.

In [66]:
df_film.head()

,film_id,title,description,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes"
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes"
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,6,2.99,130,22.99,G,Deleted Scenes

Al ver el cabecero de la tabla, observo que en la columna de "special_features" las frases separadas por una "," no cuentan con el espacio que debe haber. Así, lo modifico:

In [67]:
df_film["special_features"] = df_film["special_features"].str.replace(',', ', ')

Voy, para concluir con esta tabla, reorganizar también el orden en el que están dispuestas las columnas:

In [68]:
nuevo_orden = ['film_id', "title", "description", "special_features", "rating", "length", "rental_duration", "rental_rate", "replacement_cost"]

In [69]:
df_film = df_film.reindex(columns=nuevo_orden)

In [70]:
# Columnas que contienen valores nulos y la cantidad de estos en cada una de ellas:

nan_cols_film = df_film.isna().sum() #De nuevo, ninguna.
nan_cols_film[nan_cols_film>0]

Series([], dtype: int64)

In [71]:
df_film.shape

(1000, 9)

In [72]:
df_film.duplicated().any() #Compruebo duplicados.

False

In [73]:
df_film.head()

,film_id,title,description,special_features,rating,length,rental_duration,rental_rate,replacement_cost
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,"Deleted Scenes, Behind the Scenes",PG,86,6,0.99,20.99
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,"Trailers, Deleted Scenes",G,48,3,4.99,12.99
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,"Trailers, Deleted Scenes",NC-17,50,7,2.99,18.99
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,"Commentaries, Behind the Scenes",G,117,5,2.99,26.99
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,Deleted Scenes,G,130,6,2.99,22.99

# 4. DataFrame Inventory.

In [76]:
df_original_inventory = pd.read_csv('data/inventory.csv', encoding='latin1')
df_inventory = df_original_inventory.copy()

In [77]:
dim_original_inventory = df_inventory.shape # De esta forma guardo las dimensiones del data frame original.
df_inventory.shape

(1000, 4)

In [78]:
df_inventory.head()

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17
2             3        1         1  2006-02-15 05:09:17
3             4        1         1  2006-02-15 05:09:17
4             5        1         2  2006-02-15 05:09:17

In [79]:
df_inventory.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   inventory_id  1000 non-null   int64
 1   film_id       1000 non-null   int64
 2   store_id      1000 non-null   int64
 3   last_update   1000 non-null   object
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [80]:
df_inventory.last_update.unique() # De nuevo, el valor de esta columna está repetido a lo largo de todas ella. Lo eliminamos.

array(['2006-02-15 05:09:17'], dtype=object)

In [81]:
df_inventory.drop(columns=["last_update"], inplace=True)

In [82]:
#df_inventory.inventory_id.unique()

In [83]:
#df_inventory.film_id.unique()

In [84]:
df_inventory.store_id.unique()

array([1, 2])

La columna recién mencionada, "store_id" no guarda ninguna relación con el resto de las tablas. Sin embargo, puede contener información relevante acerca de que ubicación tenía un mayor rendimiento o mayores gananciales, de cara a la localización de la nueva tienda. Es decir, si, por ejemplo, deseamos evaluar cuál de las dos tiendas tenía un mejor rendimiento de cara su reapertura, es valioso mantenerla en la base de datos.

In [85]:
nan_cols_inventory = df_inventory.isna().sum() # Observamos si la columnas tienen valores nulos
nan_cols_inventory[nan_cols_inventory>0]

Series([], dtype: int64)

In [86]:
df_inventory.duplicated().any() #Compruebo duplicados.

False

In [87]:
df_inventory.head()

   inventory_id  film_id  store_id
0             1        1         1
1             2        1         1
2             3        1         1
3             4        1         1
4             5        1         2

# 5. DataFrame Language.

In [88]:
df_original_language = pd.read_csv('data/language.csv', encoding='latin1')
df_language = df_original_language.copy()

In [89]:
dim_original_language = df_language.shape # Guardamos las dimensiones del data frame original.
df_language.shape

(6, 3)

In [90]:
df_language.head(7)

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19
5            6    German  2006-02-15 05:02:19

In [91]:
df_language.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   language_id  6 non-null      int64
 1   name         6 non-null      object
 2   last_update  6 non-null      object
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

Nos deshacemos, por el mismo motivo que hasta ahora, de la columna otra vez más, nos deshacemos de la columna "last_update":

In [92]:
df_language.last_update.unique()

array(['2006-02-15 05:02:19'], dtype=object)

In [93]:
df_language.drop(columns=["last_update"], inplace=True)

In [94]:
df_language.language_id.unique() #Esta información nos hace ver, al observar los

array([1, 2, 3, 4, 5, 6])

En el DataFrame "df_film", hemos eliminado una columna que indicaba el idioma de cada película. Esto se debió a que el valor en esa columna era idéntico en todas las filas, lo que sugiere que todas las películas en la base de datos están en el mismo idioma, en este caso, en inglés.

Esta observación plantea la pregunta de si es necesario mantener una tabla para almacenar información de idioma cuando todas las películas tienen el mismo. 

Sin embargo, he decidido conservar esta tabla en caso de que en el futuro se agreguen películas en otros idiomas. Puede resultar útil para catalogar y gestionar películas en diferentes idiomas si surge esa necesidad.

In [95]:
df_language.name.unique()

array(['English', 'Italian', 'Japanese', 'Mandarin', 'French', 'German'],
      dtype=object)

Al igual que en "df_actor" o "df_category", considero que sería una buena práctica cambiar el nombre de la columna "name" por motivo de que en caso de ser igual, podría causar confusión cuando manejemos todas las tablas en conjunto.

In [96]:
df_language.rename(columns={"name": "language_name"}, inplace=True)

In [97]:
df_language.duplicated().any() #Comprobamos duplicados.

False

In [98]:
df_language.head()

   language_id language_name
0            1       English
1            2       Italian
2            3      Japanese
3            4      Mandarin
4            5        French

# 6. DataFrame old_HDD.

In [100]:
df_original_old_hdd = pd.read_csv('data/old_HDD.csv', encoding='latin1')
df_old_hdd = df_original_old_hdd.copy()

In [101]:
dim_original_old_hdd = df_old_hdd.shape
df_old_hdd.shape

(1000, 5)

In [102]:
df_old_hdd.head()

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [103]:
df_old_hdd.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   first_name    1000 non-null   object
 1   last_name     1000 non-null   object
 2   title         1000 non-null   object
 3   release_year  1000 non-null   int64
 4   category_id   1000 non-null   int64
dtypes: int64(2), object(3)
memory usage: 39.2+ KB

Determinamos si alguna de las columnas contiene valores constantes con el fin de eliminarlos, por motivo de que no aportan información relevante.

In [104]:
cte_cols_old_hdd = []
for c in df_old_hdd.select_dtypes(include=np.number):   # para cada columna numerica.....   
    if len(df_old_hdd[c].unique()) == 1:    
        cte_cols_old_hdd.append(c)
cte_cols_old_hdd

['release_year']

Vemos que hay uno, lo eliminamos:

In [105]:
df_old_hdd.drop(columns=["release_year"], inplace=True)

A continuación, igual que en la tabla "df_actor", combino de las columnas "first_name" y "last_name" en una sola columna llamada "actor_name," que contendría el nombre completo de la persona.

Luego, elimino las recién combinadas: "first_name" y "last_name".

In [106]:
df_old_hdd["actor_name"] = df_old_hdd["first_name"] + ' ' + df_old_hdd["last_name"]

In [107]:
df_old_hdd.head()

  first_name last_name                  title  category_id        actor_name
0   PENELOPE   GUINESS       ACADEMY DINOSAUR            6  PENELOPE GUINESS
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS            2  PENELOPE GUINESS
2   PENELOPE   GUINESS            ANGELS LIFE           13  PENELOPE GUINESS
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS           10  PENELOPE GUINESS
4   PENELOPE   GUINESS          CHEAPER CLYDE           14  PENELOPE GUINESS

In [108]:
df_old_hdd.drop(columns=["first_name"], inplace=True)
df_old_hdd.drop(columns=["last_name"], inplace=True)

Después de un análisis, he llegado a la conclusión de que esta tabla contiene información valiosa en lo que respecta a los títulos de las películas y los nombres de los actores. Esta información podría servir como un vínculo entre las tablas "df_actor" y "df_film", algo que resulta de especial importancia.

Para lograr esto, planeo unir esta tabla con las columnas de "actor_id" y de "film_id" mediante "merge". Al hacerlo, incorporaré los identificadores (IDs) de actores y películas a esta tabla, lo que permitirá futuras consultas y análisis que involucren a ambas tablas.

In [109]:
df_old_hdd = df_old_hdd.merge(df_actor[["actor_name", "actor_id"]], on="actor_name", how="left")
df_old_hdd = df_old_hdd.merge(df_film[["title", "film_id"]], on="title", how="left")

In [110]:
df_old_hdd.head()

                   title  category_id        actor_name  actor_id  film_id
0       ACADEMY DINOSAUR            6  PENELOPE GUINESS         1        1
1   ANACONDA CONFESSIONS            2  PENELOPE GUINESS         1       23
2            ANGELS LIFE           13  PENELOPE GUINESS         1       25
3  BULWORTH COMMANDMENTS           10  PENELOPE GUINESS         1      106
4          CHEAPER CLYDE           14  PENELOPE GUINESS         1      140

En este punto, me planteo si tiene sentido mantener la tabla de categorías o si sería preferible juntarla con esta. Tras algo de investigación, llego a la conclusión de que tiene sentido mantener la conexión entre ellas a través de una clave externa (category_id), pues conlleva varias ventajas.

En primer lugar, al establecer una relación, nos aseguramos que las películas se asignen correctamente a las categorías mediante la clave externa (category_id), lo cual evita la entrada de datos incorrectos o inconsistentes.
Además, se evita la duplicación innecesaria de datos, lo que ahorra espacio de almacenamiento, especialmente si hay muchas películas en distintas categorías.
Por último, facilita las actualizaciones de categorías, es decir, si resulta necesario hacer cambios o agregar nuevas categorías en un futuro, solo tendrá que hacerse en la tabla de categorías. Las películas relacionadas seguirán estando vinculadas a sus respectivas categorías sin necesidad de modificar la tabla de películas.

In [111]:
df_old_hdd["actor_name"].value_counts()

SANDRA KILMER          37
VAL BOLGER             35
UMA WOOD               35
RIP CRAWFORD           33
JULIA MCQUEEN          33
HELEN VOIGHT           32
KARL BERRY             31
WOODY HOFFMAN          31
VIVIEN BERGEN          30
LUCILLE TRACY          30
GRACE MOSTEL           30
ALEC WAYNE             29
JOHNNY LOLLOBRIGIDA    29
BURT DUKAKIS           29
CUBA OLIVIER           28
KIRSTEN PALTROW        27
FRED COSTNER           27
ELVIS MARX             26
TOM MCKELLEN           25
AUDREY OLIVIER         25
NICK WAHLBERG          25
BOB FAWCETT            25
ZERO CAGE              25
JOE SWANK              25
CAMERON STREEP         24
MILLA PECK             24
TIM HACKMAN            23
CHRISTIAN GABLE        22
JENNIFER DAVIS         22
ED CHASE               22
DAN TORN               22
KEVIN BLOOM            21
MATTHEW JOHANSSON      20
BETTE NICHOLSON        20
PENELOPE GUINESS       19
SANDRA PECK            19
SISSY SOBIESKI         18
JUDY DEAN              15
GOLDIE BRODY            7
Name: actor_name, dtype: int64

In [112]:
df_old_hdd["title"].value_counts()

BOONDOCK BALLROOM     6
FLASH WARS            5
STRANGER STRANGERS    5
OKLAHOMA JUMANJI      5
CHITTY LOCK           5
                     ..
FLYING HOOK           1
EGYPT TENENBAUMS      1
BUTCH PANTHER         1
TYCOON GATHERING      1
EXORCIST STING        1
Name: title, Length: 614, dtype: int64

Creo que sería apropiado reorganizar la disposición de las columnas:

In [113]:
nuevo_orden = ["actor_id", "film_id", "actor_name", "title", "category_id"]

In [114]:
df_old_hdd = df_old_hdd.reindex(columns=nuevo_orden)

In [115]:
nan_cols_old_hdd = df_old_hdd.isna().sum() # Observamos si hay valores nulos en alguna de la columnas. 
nan_cols_old_hdd[nan_cols_old_hdd>0]

Series([], dtype: int64)

In [116]:
#Comprobamos duplicados:

df_old_hdd.duplicated().any()

False

In [117]:
df_old_hdd.head()

   actor_id  film_id        actor_name                  title  category_id
0         1        1  PENELOPE GUINESS       ACADEMY DINOSAUR            6
1         1       23  PENELOPE GUINESS   ANACONDA CONFESSIONS            2
2         1       25  PENELOPE GUINESS            ANGELS LIFE           13
3         1      106  PENELOPE GUINESS  BULWORTH COMMANDMENTS           10
4         1      140  PENELOPE GUINESS          CHEAPER CLYDE           14

# 7. DataFrame Rental.

In [118]:
df_original_rental = pd.read_csv('data/rental.csv', encoding='latin1')
df_rental = df_original_rental.copy()

In [119]:
dim_original_rental = df_rental.shape
df_rental.shape

(1000, 7)

In [120]:
df_rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [121]:
df_rental.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1000 non-null   int64
 1   rental_date   1000 non-null   object
 2   inventory_id  1000 non-null   int64
 3   customer_id   1000 non-null   int64
 4   return_date   1000 non-null   object
 5   staff_id      1000 non-null   int64
 6   last_update   1000 non-null   object
dtypes: int64(4), object(3)
memory usage: 54.8+ KB

In [122]:
df_rental.last_update.unique()

array(['2006-02-15 21:30:53'], dtype=object)

También en este caso la columna "last_update" contiene un solo valor único. La eliminamos:

In [123]:
df_rental.drop(columns=["last_update"], inplace=True)

Ahora, he decidido que posiblemente la hora de recogida y devolución de una película no aporta ningún valor significativo, ya que la "rental_duration" se expresa en días completos. Por lo tanto, convertiré ahora estas dos columnas en formato datetime, separaré la fecha y la hora, y eliminaré esta última información:

In [124]:
df_rental["rental_date"] = pd.to_datetime(df_rental["rental_date"])
df_rental["return_date"] = pd.to_datetime(df_rental["return_date"])

In [125]:
df_rental["rental_date"] = df_rental["rental_date"].dt.date
df_rental["return_date"] = df_rental["return_date"].dt.date

In [126]:
df_rental.rental_date.unique()

array([datetime.date(2005, 5, 24), datetime.date(2005, 5, 25),
       datetime.date(2005, 5, 26), datetime.date(2005, 5, 27),
       datetime.date(2005, 5, 28), datetime.date(2005, 5, 29),
       datetime.date(2005, 5, 30), datetime.date(2005, 5, 31)],
      dtype=object)

In [127]:
#df_rental.inventory_id.unique()

Puede observarse que existen valores de "inventory_id" que no están presentes en la tabla "df_inventory".

Para abordar esta situación, se plantean dos posibles soluciones: Como primera opción, dejarlos; o como segunda (la cual he decidio seguir), implica eliminar dichos valores. 
Baso esta dedcisión en no dispongo de información que indique su origen. Se asume que las tablas pueden estar incompletas.

In [128]:
df_rental = df_rental[df_rental.inventory_id < 1001]

En la tabla "df_film", existe una columna denominada "rental_duration". Esta información se puede obtener calculando la diferencia entre el "rental_date" y el "return_date". Procedemos:

In [129]:
df_rental["rental_duration"] = (df_rental["return_date"] - df_rental["rental_date"]).dt.days

In [130]:
df_rental.rental_duration.unique() #3,4,5,6,7

array([ 2,  1,  5,  4,  6,  9,  7,  8,  3,  0, 10])

Al igual que sucedía con los valores de "inventory_id," que no concordaban con los de la tabla "df_inventory," nos encontramos, en este caso, en una situación similar: existen más valores en la columna "rental_duration" de lo esperado. 

Por tanto, siguiendo la misma lógica que en el caso anterior, optaré por eliminar estos valores adicionales, ya que no se dispone de información que explique esta discrepancia.

In [131]:
rental_durations_coincidentes = [3, 4, 5, 6, 7]
df_rental = df_rental[df_rental["rental_duration"].isin(rental_durations_coincidentes)]

In [132]:
df_rental.rental_duration.unique()

array([5, 4, 6, 7, 3])

In [133]:
df_rental.rental_date.unique()

array([datetime.date(2005, 5, 25), datetime.date(2005, 5, 26),
       datetime.date(2005, 5, 27), datetime.date(2005, 5, 28),
       datetime.date(2005, 5, 29), datetime.date(2005, 5, 30),
       datetime.date(2005, 5, 31)], dtype=object)

In [134]:
df_rental.return_date.unique()

array([datetime.date(2005, 5, 30), datetime.date(2005, 5, 29),
       datetime.date(2005, 5, 31), datetime.date(2005, 6, 1),
       datetime.date(2005, 5, 28), datetime.date(2005, 6, 2),
       datetime.date(2005, 6, 3), datetime.date(2005, 6, 4),
       datetime.date(2005, 6, 5), datetime.date(2005, 6, 6)], dtype=object)

Al examinar los datos, resulta evidente que no son demasiado consistentes. En realidad, estos datos ofrecen una información limitada para su estudio.

La recopilación de datos se limita a un corto período de tiempo, específicamente los meses de mayo y junio. Esto resulta en una muestra extremadamente reducida como para predecir cualquier o determinar cualquiero suceso futuro con respecto a la reapertura del videoclub.

In [135]:
df_rental.customer_id.value_counts()

551    3
44     2
246    2
287    2
360    2
      ..
508    1
430    1
587    1
446    1
150    1
Name: customer_id, Length: 100, dtype: int64

In [136]:
df_rental.staff_id.unique()

array([2, 1])

De manera similar a lo que mencionamos con la columna "store_id," en este caso, tanto "customer_id" como "staff_id" no están directamente relacionados ni vinculados a otra tabla. No obstante, es importante destacar que podrían contener información relevante, como la eficacia del personal en sus funciones o si existen clientes habituales que repiten debido a una experiencia positiva.

Para ir concluyendo, procederé a reorganizar las columnas de acuerdo a un orden que considero más claro.

In [137]:
nuevo_orden = ["rental_id", "rental_duration", "rental_date", "return_date", "customer_id", "staff_id"]

In [138]:
df_rental = df_rental.reindex(columns=nuevo_orden)

In [139]:
nan_cols_rental = df_rental.isna().sum() # Observamos si la columnas tienen valores nulos
nan_cols_rental[nan_cols_rental>0]

Series([], dtype: int64)

In [140]:
#Por último, comprobamos duplicados:

df_rental.duplicated().any()

False

In [141]:
df_rental.head()

    rental_id  rental_duration rental_date return_date  customer_id  staff_id
28         29                5  2005-05-25  2005-05-30           44         2
36         37                4  2005-05-25  2005-05-29          535         1
41         42                6  2005-05-25  2005-05-31          523         2
59         60                5  2005-05-25  2005-05-30          470         1
61         62                5  2005-05-25  2005-05-30          419         1